Tekla Open API Reference for Tekla Structures 2025
Polyline.Attributes Property
 The attributes for the polyline.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Polyline.PolylineAttributes Attributes { get; set; }
Public Property Attributes As Polyline.PolylineAttributes
	Get
	Set
Property Value
Type: Polyline.PolylineAttributes
See Also
Reference
Polyline Class
Tekla.Structures.Drawing Namespace